<template>
    <div class="outer">
        <div class="inner">
            <p class="title"> 常见问题（FQA）</p>
            <ul>
                <li>1.云算力是什么？</li>
                <li>不需要自己挖矿，不用忍受矿机的噪音。我们为您部署市面上最先进的矿机，通过低功耗、低电费、高收益以及专业维护，为您提供最高性价比的挖矿服务，您只需购买算力，即可实时开启比特币挖矿，免去部署矿机的烦恼，同时获得更高投资回报。我们通过大规模的专业矿场部署，最大限度降低成本，将挖矿收益最大化。</li>
            </ul>
            <ul>
                <li>2.云算力购买后何时产生收益？</li>
                <li>云算力购买成功后，到交割时间，开始产生挖矿收益。每日收益以数字货币的形式，发放到用户个人账户。用户可以将个人账户的币，提现到个人钱包地址。每日的收益根据算力难度上涨或者币价波动，每日的收益会不同。</li>
            </ul>
            <ul>
                <li>3.云算力收益是如何计算发放的？</li>
                <li>
                    算力收益通过PPS（Pay Per Share）模式结算，在收益结算时根据实时价格扣除电费，收取8%的管理费，每日结算昨天的收益，定时发放。
                </li>
            </ul>
            <ul>
                <li>4.云算力计算收益扣除哪些费用？</li>
                <li>
                    每日计算收益时，需扣除电费和管理费。电费管理费一般都不会变化，但是遇到特殊情况，需要对电费管理费进行调整，我们通过邮件和短信的形式通知您。
                </li>
            </ul>
            <ul>
                <li>5.云算力计算电费时，加密货币价格如何确定？</li>
                <li>
                    在每天结算收益的时候依据交易平台（默认使用火币网）北京时间上午8:00左右的价格进行自动结算，如果默认的平台存在技术或者网络问题，蜜蜂云算力有权力更换交易平台而不再另行通知。
                </li>
            </ul>
            <ul>
                <li>6.购买云算力遇到问题怎么办？</li>
                <li>
                    请您微信搜索关注我们的微信公众号：蜜蜂矿池（或扫描网站底部的二维码关注），直接联系我们的客服微信，将您遇到的问题反馈给我们，我们的客服人员会在第一时间回复您。也可以加入下方的QQ群会有专人解答您的问题。
                </li>
            </ul>
            <ul>
                <li>7.可以退款吗？</li>
                <li>投资行业需要客户考虑自身情况与投资风险的前提下进行合作，蜜蜂云算力作为服务商不提供任何投资意见，一旦交易达成概不退款。</li>
            </ul>
            <ul>
                <li>8.挖矿收益一直发放吗？</li>
                <li>
                    挖矿收益足够支付电费和管理费时，挖矿收益会持续发放到用户个人账户。由于算力难度上涨或者币价下跌导致挖矿收益连续10天不足以支付电费和管理费，挖矿收益将停止发放，并且合约暂停。合约暂停后，我们将对每日收益统计，如果连续两天收益高于电费，第三天我们会继续支付收益。合约暂停时，不用支付任何费用！合约暂停功能，仅限2018年12月31日之前。
                </li>
            </ul>
            <ul>
                <li>9.能否评估下项目回报，大约什么时候能够回本？</li>
                <li>
                    挖矿是一个波动极大的行业，用户的回本进度取决于算力难度和币价的变化。从过去的经验来看，用户应该能够较快收回买算力时的投资，并获得丰厚回报。但是，根据国家互联网金融相关法律法规，蜜蜂云不做任何回本承诺，请用户注意投资风险。
                </li>
            </ul>
            <ul>
                <li>10.如何提取收益？</li>
                <li>
                    当您的云算力实际产出的加密货币大于设定限额时，您可以用户中心添加您的个人加密钱包地址，输入您想提取的数量，点击申请提币，即可将您所需要的加密货币提取到您的私人钱包地址。该地址可以是全球任何地方任何人的加密货币地址。Beehsah只对您的申请负责，不会核实加密货币地址的身份，提币操作您需要承担一定的手续费，会从您的提币数量中扣除。
                </li>
            </ul>
        </div>
    </div>
</template>

<script>
    
</script>

<style scoped>
.title{
    text-align: center;
    font-size: 20px;
    font-weight:bold;
    color:#333333;
    margin-top:0;
    margin-bottom:70px;
}
.outer{
    background-color:#f9f9f9;
    padding:30px 0;
}
.inner{
    width:1100px;
    padding:50px;
    box-sizing: border-box;
    margin: 0 auto;
    background-color:#ffffff;
}
ul{
    padding:0;
}
ul li:nth-child(1){
    font-weight:bold;
    color:#464646;
    margin-bottom:25px;
}
ul li:nth-child(2){
    color:#999999;
    margin-bottom:40px;
    background-color:#f5f5f5;
    padding:10px 5px;
}
</style>
