<template>
    <div class="wraper">
        <ul class="content">
            <h3 style="font-weight:bold;color:#464646;font-size: 24px;text-align:center;">Beehash用户注册服务协议</h3>
            <p class="item-desc" style="text-align:justify;">
                通过使用本网站，注册Beehash帐户或使用我们的任何其他Beehash服务，您同意接受并遵守条款和使用条款。
                在使用本网站或任何Beehash服务之前，请仔细阅读完整的使用条款。若您不接受以下条款，请您立即停止注
                册或主动停止使用本网站的服务。根据您所居住的国家/地区，您可能无法使用本网站的所有功能。您有责任
                遵守您访问本网站和服务的居住国家/或地区的这些规则和法律。请注意，Beehash有权对本协议进行修改，恕
                不另行通知补发，请您定期查看本条款，因为您继续使用该网站将被视为是不可撤销的接受任何修订。本协议
                所称“数字币”：不仅包括国际上目前通行的比特币（BTC）、莱特币（LTC）、以太坊（ETH）、以太经典（ETC）、
                以链克币（OSC）等数字资产。本条款不涉及Beehash用户与其他用户之间因数字币交易而产生的法律关系及法律纠纷。
            </p>
            <li>
                <p class="item-name">服务内容</p>
                <p class="item-desc">
                    1.Beehash运用自己的系统，通过互联网等方式为用户提供云算力服务。
                </p>
                <p class="item-desc"> 
                    2.用户提供的注册资料，用户同意：
                    （1）提供合法、真实、准确的个人资料；
                    （2）如有变动，及时更新用户资料。如果用户提供的注册资料不合法、不真实、不准确的，用户需承担因此引起的相应
                        责任及后果，并且Beehash保留终止用户使用Beehash各项服务的权利。
                </p>
            </li>
            <li>
                <p class="item-name">用户信息的保密</p>
                <p class="item-desc">
                     1.本协议所称之Beehash用户信息是指符合法律、法规及相关规定，并符合下述范围的信息：
                    （1）用户注册Beehash时，向Beehash提供的个人信息；
                    （2）用户在使用Beehash服务、参加网站活动或访问网站网页时，Beehash自动接收并记录的用户浏览器端数据，
                        包括但不限于IP地址、网站Cookie中的资料及用户要求取用的网页记录；
                    （3）Beehash从商业伙伴处合法获取的用户个人信息；
                    （4）其它Beehash通过合法途径获取的用户个人信息。
                </p>
                <p class="item-desc"> 
                    2.Beehash承诺未经法定原因或用户事先许可，Beehash不会向任何第三方透露用户的密码、姓名、手机号码、证件号码等非
                    公开信息。
                </p>
                <p class="item-desc"> 
                    3.在下述法定情况下，用户的个人信息将会被部分或全部披露。
                    （1）经用户同意向用户本人或其他第三方披露；
                    （2）根据法律、法规等相关规定，或行政机构要求，向行政、司法机构或其他法律规定的第三方披露；
                    （3）其他Beehash根据法律、法规等相关规定进行的披露。
                </p>
            </li>
            <li>
                <p class="item-name">用户权利</p>
                <p class="item-desc">
                    1.用户的用户名、密码和安全性
                    （1）用户名不可重复注册。用户名一旦注册成功，不可更改。
                    （2）用户一旦注册成功，成为Beehash的用户，将得到用户名（用户邮箱）和密码，并对以此组用户名和密码登入系统后所
                        发生的所有活动和事件负责，自行承担一切使用该用户名发布的言语、行为等而直接或间接导致的法律责任。
                    （3）用户有义务妥善保管Beehash账号、用户名和密码、短信验证码、，用户将对用户名和密码安全负全部责任。因用户原
                        因导致用户名或密码泄露而造成的任何法律后果由用户本人负责，由于用户自身原因泄露这些信息导致的财产损失，本
                        站不负相关责任。由于Beehash是云算力购买网站，登录密码、防钓鱼码等不得使用相同密码，否则会有安全隐患，相关
                        责任由用户自身承担。
                    （4）用户密码遗失的，可以通过注册电子邮箱发送的链接重置密码。用户若发现任何非法使用用户名或存在其他安全漏洞的情
                        况，应立即告知Beehash。
                    （5）Beehash不会向任何用户索取密码，不会让用户往任何非本站交易中心里提供的帐户、充值地址充值数字币，请大家不要
                        相信任何非Beehash官方发布的诈骗信息，往非交易中心提供的账户、地址里充值数字币造成的损失本站不负责任。
                </p>
                <p class="item-desc" style="line-height:30px;"> 
                    2.用户有权修改其账户个人中心、安全设置中各项可修改信息，自行选择录入介绍性文字，自行决定是否提供非必填项的内容；<br/>
                    3.用户有权根据网站相关规定，获得Beehash给与的奖励（如手续费按比例返现，推广奖励等）；<br/>
                    4.用户有权按照Beehash发布的活动规则参与Beehash组织的各项线上、线下活动（包括各官方平台社区发起的活动）。<br/>
                    5.用户有权查看其Beehash账号下的信息。<br/>
                    6.用户有权根据Beehash网站规定，应用Beehash提供的功能进行操作、享受Beehash提供的其它各类服务。
                </p>
            </li>
            <li>
                <p class="item-name">用户义务</p>
                <p class="item-desc">
                    1.不得利用本站危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本站制作、复制和传播下列信息：
                    （1）煽动抗拒、破坏宪法和法律、行政法规实施的；
                    （2）煽动颠覆国家政权，推翻社会主义制度的；
                    （3）煽动分裂国家、破坏国家统一的；
                    （4）煽动民族仇恨、民族歧视，破坏民族团结的；
                    （5）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；
                    （6）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；
                    （7）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；
                    （8）损害国家机关信誉的；
                    （9）其他违反宪法和法律行政法规的；
                    （10）进行商业广告行为的。
                </p>
                <p class="item-desc">
                    2.用户不得通过任何手段恶意注册Beehash帐号，包括但不限于以牟利、炒作、套现等为目的多个账号注册。用户亦不得盗用
                    其他用户帐号。如用户违反上述规定，则Beehash有权直接采取一切必要的措施，包括但不限于删除用户发布的内容、取消用
                    户在网站获得的星级、荣誉以及虚拟财富，暂停或查封用户帐号，取消因违规所获利益，乃至通过诉讼形式追究用户法律责任
                    等。
                </p>
                <p class="item-desc">
                    3.禁止用户将Beehash以任何形式作为从事各种非法活动的场所、平台或媒介。未经Beehash的授权或许可，用户不得借用本
                    站的名义从事任何商业活动，也不得以任何形式将Beehash作为从事商业活动的场所、平台或媒介。如用户违反上述规定，
                    则Beehash有权直接采取一切必要的措施，包括删除用户发布的内容、取消用户在网站获得的星级、荣誉以及虚拟财富，暂停
                    或查封用户帐号，取消因违规所获利益，乃至通过诉讼形式追究用户法律责任等。
                </p>
                <p class="item-desc">
                    4.用户在Beehash以各种形式发布的一切信息，均应符合国家法律法规等相关规定及网站相关规定，符合社会公序良俗，并不
                    侵犯任何第三方主体的合法权益，否则用户自行承担因此产生的一切法律后果，且火狐狸网因此受到的损失，有权向用户追偿。
                </p>
            </li>
            <li>
                <p class="item-name">服务的提供、修改及终止</p>
                <p class="item-desc">
                    1.用户在接受Beehash各项服务的同时，同意接受Beehash提供的各类信息服务。用户在此授权Beehash可以向其账户、电
                    子邮件、手机等发送商业信息。用户可进入Beehash相关页面更改联系方式。
                </p>
                <p class="item-desc">
                    2.Beehash保留随时修改或中断服务而不需通知用户的权利，Beehash有权行使修改或中断服务的权利，不需对用户或任何无直接
                    关系的第三方负责。
                </p>
                <p class="item-desc">
                    3.法律允许范围内，无论在以下何种情况下：信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、
                罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命
                令、其他不可抗力或第三方的不作为而造成的服务终止或服务延迟以及用户因此而遭受的损失，Beehash不承担责任。
                </p>
                <p class="item-desc">
                    4.用户对本协议的修改有任何异议或对Beehash的服务有任何不满，可以行使以下权利:
                （1）停止使用Beehash的网络服务。
                （2）通过客服、支持等渠道告知Beehash停止对其服务。结束服务后，用户使用Beehash网络服务条款的权利立即终止。在此情
                况下，Beehash没有义务传送任何未处理的消息或未完成的服务给用户或任何无直接关系的第三方。
                </p>
            </li>
            <li>
                <p class="item-name">拒绝担保与免责</p>
                <p class="item-desc">
                    1.Beehash作为“网络服务提供者”的第三方平台，不担保网站平台上的信息及服务能充分满足用户的需求。对于用户在接受Beehash
                    的服务过程中可能遇到的错误、侮辱、诽谤、不作为、淫秽、色情或亵渎事件，Beehash不承担法律责任。
                </p>
                <p class="item-desc">
                    2.基于互联网的特殊性，Beehash也不担保服务不会受中断，对服务的及时性、安全性都不作担保，不承担非因Beehash导致的责任
                    。Beehash力图使用户能对本网站进行安全访问和使用，但Beehash不声明也不保证本网站或其服务器是不含病毒或其它潜在有害因
                    素的；因此用户应使用业界公认的软件查杀任何自Beehash下载文件中的病毒。
                </p>
                <p class="item-desc">
                    3.Beehash不对用户所发布信息的保存、修改、删除或储存失败负责。对网站上的非因Beehash故意所导致的排字错误、疏忽等不承
                    担责任。Beehash有权但无义务，改善或更正本网站任何部分之疏漏、错误。
                </p>
                <p class="item-desc">
                    4.除非Beehash以书面形式明确约定，Beehashl对于用户以任何方式（包括但不限于包含、经由、连接或下载）从本网站所获得的
                任何内容信息，包括但不限于广告等，不保证其准确性、完整性、可靠性；对于用户因本网站上的内容信息而购买、获取的任何产
                品、服务、信息或资料Beehash不承担责任。用户自行承担使用本网站信息内容所导致的风险。
                </p>
                <p class="item-desc">
                    5.Beehash内所有用户所发表的用户评论，仅代表用户个人观点，并不表示本网站赞同其观点或证实其描述，本网站不承担用户评
                论引发的任何法律责任。
                </p>
                <p class="item-desc">
                    6.Beehash有权删除Beehash内各类不符合法律或协议规定的信息，而保留不通知用户的权利。
                </p>
                <p class="item-desc">
                    7.所有发给用户的通告，Beehash都将通过正式的页面公告、站内消息、电子邮件、客服电话、手机短信或常规的信件送达。任何
                非经Beehash正规渠道获得的中奖、优惠等活动或信息，Beehash不承担法律责任。
                </p>
                <p class="item-desc">
                    8.Beehash有权根据市场情况调整提现、交易、对冲工具利息等手续费费率，有权决定免费推广期的终止。
                </p>
            </li>
            <li>
                <p class="item-name">关于协议</p>
                <p class="item-desc">
                    1.本协议是Beehash与用户注册成为Beehash用户，使用Beehash服务之间的重要法律文件，Beehash或者用户的任何其他书面或者
                口头意思表示与本协议不一致的，均应当以本协议为准。
                </p>
                <p class="item-desc">
                    2.如果本协议的任何条款被视为不合法、无效或因任何原因而无法执行，则此等规定应视为可分割，不影响任何其它条款的法律效
                力。
                </p>
                <p class="item-desc">
                    3.因用户使用Beehash而引起或与之相关的一切争议、权利主张或其它事项，均受中华人民共和国法律的管辖。
                </p>
                <p class="item-desc">
                    4.本协议于用户勾选Beehash注册页面的网络服务条款并完成注册程序、获得Beehash账号和密码时生效，对Beehash和用户均具
                有约束力。
                </p>
            </li>
        </ul>
    </div>
</template>

<script>

</script>

<style scoped>
.wraper{
    background-color:#f9f9f9;
    padding:50px 0;
}
.content{
    width:1000px;
    margin: 0 auto;
    padding: 50px;
    background-color: #ffffff;
}
.content h3{
    margin-top:0;
}
.item-name{
    font-weight:bold;
    color:#464646;
    margin-bottom:25px;
}
.item-desc{
    text-align: justify;
    color:#999999;
    margin-bottom:20px;
}
</style>

